---
type: ComboBoxData
namespace: Autodesk.Revit.UI
version: 2024
members: 2
tags: [revit-api, class]
---

# ComboBoxData

`Autodesk.Revit.UI.ComboBoxData` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ComboBoxData | 2011 | `public ComboBoxData ( string name )` |
| Property | Image | 2011 | `public ImageSource Image { get ; set ; }` |